/*
	This file is part of CoDExtended.

    CoDExtended is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    CoDExtended is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with CoDExtended.  If not, see <http://www.gnu.org/licenses/>.
*/

#ifndef SHARED_H
#define SHARED_H

#ifdef _WIN32
#include <windows.h>
#endif
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <dlfcn.h>
#include <sys/mman.h>
#include <execinfo.h>
#include <stddef.h>
#include <stdarg.h>
#include <ctype.h>
#include <time.h>
#include <stdbool.h>
#include <sys/types.h>
#include <stdint.h>
#include "util.h"
#include "surfaceflags.h"

#include "build.txt"

#ifdef uMYSQL
#include "mysql/mysql.h"
#endif
#include <malloc.h>
#include <mcheck.h>

typedef unsigned char byte;
typedef unsigned char boolean;
#define __cdecl __attribute__((__cdecl__))
#define QDECL __cdecl
#define __fastcall __attribute__((fastcall))

#ifdef xDEBUG
#define _STRIP __attribute__((visibility ("hidden")))
#define _VIS __attribute__((visibility ("default")))

vec_t _VectorNormalize( vec3_t v );
void _VectorNormalizeFast( vec3_t v );
vec_t _VectorNormalize2( const vec3_t v, vec3_t out );
vec_t _VectorLength( const vec3_t v );
vec_t _VectorLengthSquared( const vec3_t v );
vec_t _Distance( const vec3_t p1, const vec3_t p2 );
vec_t _DistanceSquared( const vec3_t p1, const vec3_t p2 );
void _VectorInverse( vec3_t v );
void _Vector4Scale( const vec4_t in, vec_t scale, vec4_t out );
void _AngleVectors( const vec3_t angles, vec3_t forward, vec3_t right, vec3_t up );
void _MatrixMultiply( float in1[3][3], float in2[3][3], float out[3][3] );
void _PerpendicularVector( vec3_t dst, const vec3_t src );
void _GetPerpendicularViewVector( const vec3_t point, const vec3_t p1, const vec3_t p2, vec3_t up );
void _ProjectPointOntoVector( vec3_t point, vec3_t vStart, vec3_t vEnd, vec3_t vProj );
float _vectoyaw( const vec3_t vec );
float _VectorDistance( vec3_t v1, vec3_t v2 );

typedef enum {
	ERR_FATAL,                  // exit the entire game with a popup window
	ERR_VID_FATAL,              // exit the entire game with a popup window and doesn't delete profile.pid
	ERR_DROP,                   // print to console and disconnect from game
	ERR_SERVERDISCONNECT,       // don't kill server
	ERR_DISCONNECT,             // client disconnected from the server
	ERR_NEED_CD,                // pop up the need-cd dialog
	ERR_AUTOUPDATE
} errorParm_t;

/*
    CVARS
*/

#define CVAR_ARCHIVE        1   // set to cause it to be saved to vars.rc
								// used for system variables, not for player
								// specific configurations
#define CVAR_USERINFO       2   // sent to server on connect or change
#define CVAR_SERVERINFO     4   // sent in response to front end requests
#define CVAR_SYSTEMINFO     8   // these cvars will be duplicated on all clients
#define CVAR_INIT           16  // don't allow change from console at all,
								// but can be set from the command line
#define CVAR_LATCH          32  // will only change when C code next does
								// a Cvar_Get(), so it can't be changed
								// without proper initialization.  modified
								// will be set, even though the value hasn't
								// changed yet
#define CVAR_ROM            64  // display only, cannot be set by user at all
#define CVAR_USER_CREATED   128 // created by a set command
#define CVAR_TEMP           256 // can be set even when cheats are disabled, but is not archived
#define CVAR_CHEAT          512 // can not be changed if cheats are disabled
#define CVAR_NORESTART      1024    // do not clear when a cvar_restart is issued
#define CVAR_WOLFINFO       2048    // DHM - NERVE :: Like userinfo, but for wolf multiplayer info

#define CVAR_UNSAFE         4096    // ydnar: unsafe system cvars (renderer, sound settings, anything that might cause a crash)
#define CVAR_SERVERINFO_NOUPDATE        8192    // gordon: WONT automatically send this to clients, but server browsers will see it

// nothing outside the Cvar_*() functions should modify these fields!
typedef struct cvar_s {
	char        *name;
	char        *string;
	char        *resetString;       // cvar_restart will reset to this value
	char        *latchedString;     // for CVAR_LATCH vars
	int flags;
	qboolean modified;              // set each time the cvar is changed
	int modificationCount;          // incremented each time the cvar is changed
	float value;                    // atof( string )
	int integer;                    // atoi( string )
	struct cvar_s *next;
	struct cvar_s *hashNext;
} cvar_t;

#define MAX_CVAR_VALUE_STRING   256

typedef int cvarHandle_t;

// the modules that run in the virtual machine can't access the cvar_t directly,
// so they must ask for structured updates
typedef struct {
	cvarHandle_t handle;
	int modificationCount;
	float value;
	int integer;
	char string[MAX_CVAR_VALUE_STRING];
} vmCvar_t;


#define PASSFLOAT( x ) (*(INT*)&x)

#define    MASK_ALL                (-1)
#define    MASK_SOLID                (CONTENTS_SOLID)
#define    MASK_PLAYERSOLID        (CONTENTS_SOLID|CONTENTS_PLAYERCLIP|CONTENTS_BODY)
#define    MASK_DEADSOLID            (CONTENTS_SOLID|CONTENTS_PLAYERCLIP)
#define    MASK_WATER                (CONTENTS_WATER|CONTENTS_LAVA|CONTENTS_SLIME)
#define    MASK_OPAQUE                (CONTENTS_SOLID|CONTENTS_SLIME|CONTENTS_LAVA)
#define    MASK_SHOT                (CONTENTS_SOLID|CONTENTS_BODY|CONTENTS_CORPSE)

//#define MAX_STRING_CHARS    1024    // max length of a string passed to Cmd_TokenizeString
#define MAX_STRING_CHARS    1024    // max length of a string passed to Cmd_TokenizeString
#define MAX_STRING_TOKENS   256     // max tokens resulting from Cmd_TokenizeString
#define MAX_TOKEN_CHARS     1024    // max length of an individual token

#define MAX_INFO_STRING     1024
#define MAX_INFO_KEY        1024
#define MAX_INFO_VALUE      1024

#define BIG_INFO_STRING     8192    // used for system info key only
#define BIG_INFO_KEY        8192
#define BIG_INFO_VALUE      8192

#define MAX_QPATH           64      // max length of a quake game pathname
#define MAX_OSPATH          256     // max length of a filesystem pathname

// rain - increased to 36 to match MAX_NETNAME, fixes #13 - UI stuff breaks
// with very long names
#define MAX_NAME_LENGTH     36      // max length of a client name

#define MAX_SAY_TEXT        150

#define MAX_BINARY_MESSAGE  32768   // max length of binary message

typedef struct cplane_s {
	vec3_t	normal;
	float	dist;
	byte	type;
	byte	signbits;
	byte	pad[2];
} cplane_t;

typedef struct {
	float		fraction;
	vec3_t		endpos;

	vec3_t normal; //normal?
	
	//not sure can be dist? but most likely not due to too far away distance on low range and non-float
	byte	type;
	byte	signbits;
	byte	pad[2];
	
	int contents;
	char *textureName;
	int entityNum;
	int surfaceFlags; //assuming it's surfaceFlags, but where is allsolid, startsolid? ( 2.3509887e-38 or 0x01000000 )
} trace_t;

/*
========================================================================

  ELEMENTS COMMUNICATED ACROSS THE NET

========================================================================
*/

#define ANGLE2SHORT(x)  ((int)((x)*65536/360) & 65535)
#define SHORT2ANGLE(x)  ((x)*(360.0/65536))

#define SNAPFLAG_RATE_DELAYED 1
#define SNAPFLAG_NOT_ACTIVE   2 // snapshot used during connection and for zombies
#define SNAPFLAG_SERVERCOUNT  4 // toggled every map_restart so transitions can be detected

//
// per-level limits
//
#define MAX_CLIENTS     64    // absolute limit
#define MAX_LOCATIONS   64

#define GENTITYNUM_BITS   10    // don't need to send any more
#define MAX_GENTITIES   (1<<GENTITYNUM_BITS)

// entitynums are communicated with GENTITY_BITS, so any reserved
// values that are going to be communcated over the net need to
// also be in this range
#define ENTITYNUM_NONE    (MAX_GENTITIES-1)
#define ENTITYNUM_WORLD   (MAX_GENTITIES-2)
#define ENTITYNUM_MAX_NORMAL  (MAX_GENTITIES-2)

#pragma pack(1)
typedef struct {
	int overflowed; //0
	byte* data; //4
	int maxsize; //8 (most likely maxsize value 16384)
	int cursize; //12 //value 129
	int readcount; //16 //value 16
	int bit; //20 //value 0
} msg_t; //size is 0x18 (24)
#pragma pack(push, 1)

extern short   BigShort( short l );
extern short   LittleShort( short l );
extern int     BigLong( int l );
extern int     LittleLong( int l );
extern float   BigFloat( float l );
extern float   LittleFloat( float l );

typedef void (*MSG_BeginReading_t)( msg_t *msg );
typedef int     (*MSG_ReadLong_t)( msg_t *sb );
typedef char* (*MSG_ReadStringLine_t)( msg_t *sb );
typedef char * (*MSG_ReadString_t)( msg_t *);

extern MSG_ReadStringLine_t MSG_ReadStringLine;
extern MSG_ReadLong_t MSG_ReadLong;
extern MSG_BeginReading_t MSG_BeginReading;
extern MSG_ReadString_t MSG_ReadString;

typedef enum {
	FS_READ,
	FS_WRITE,
	FS_APPEND,
	FS_APPEND_SYNC
} fsMode_t;

typedef enum {
    ET_GENERAL, //0
    ET_PLAYER, //1
    ET_CORPSE, //2
    ET_ITEM, //3
    ET_MISSILE, //4
    ET_MOVER, //5
    ET_PORTAL, //6
    ET_INVISIBLE, //7
    ET_SCRIPTMOVER, //8
	ET_UNKNOWN, //9
	ET_FX, //10
	ET_TURRET, //11
	ET_EVENTS //12
} entityType_t;

typedef enum {
	TR_STATIONARY,
	TR_INTERPOLATE,             // non-parametric, but interpolate between snapshots
	TR_LINEAR,
	TR_LINEAR_STOP,
	TR_LINEAR_STOP_BACK,        //----(SA)	added.  so reverse movement can be different than forward
	TR_SINE,                    // value = base + sin( time / duration ) * delta
	TR_GRAVITY,
	// Ridah
	TR_GRAVITY_LOW,
	TR_GRAVITY_FLOAT,           // super low grav with no gravity acceleration (floating feathers/fabric/leaves/...)
	TR_GRAVITY_PAUSED,          //----(SA)	has stopped, but will still do a short trace to see if it should be switched back to TR_GRAVITY
	TR_ACCELERATE,
	TR_DECCELERATE,
	// Gordon
	TR_SPLINE,
	TR_LINEAR_PATH
} trType_t;

typedef struct {
	trType_t trType;
	int trTime;
	int trDuration;             // if non 0, trTime + trDuration = stop time
//----(SA)	removed
	vec3_t trBase;
	vec3_t trDelta;             // velocity, etc
//----(SA)	removed
} trajectory_t;

#pragma pack(1)
typedef struct {
    byte unk[480];
    int maxclients;
    int frameNum;
    int time;
    int previousTime;
    int startTime; //?idk
} level_locals_t;
#pragma pack(push, 1)
extern level_locals_t *level;

//gentity->eFlags
#define EF_DEAD 0x1
#define EF_CROUCH 0x20
#define EF_PRONE 0x40
#define EF_NODRAW 0x100
#define EF_AIM 0x200 //if a player is typing in chat or if their console is open or menu is open
#define EF_FIRING 0x400
#define EF_TALK 0x40000
#define ET_MIX = 0x3000000 //ET_BOUNCE | ET_BOUNCE_HALF
//#define ET_TURRET = 0xC000 //when player is on mg42 e.g
/* Already using ET_TURRET in entity types */
//gentity->flags
#define FL_NODRAW 0x1000

#define WBUTTON_RELOAD 8

typedef enum {
	WEAPON_READY, //0
	WEAPON_RAISING, //1
	WEAPON_DROPPING, //2
	WEAPON_FIRING, //3
	WEAPON_RECHAMBERING, //4
	WEAPON_RELOADING, //5
	WEAPON_RELOADING_INTERUPT, //6
	WEAPON_RELOAD_START, //7
	WEAPON_RELOAD_START_INTERUPT, //8
	WEAPON_RELOAD_END, //9
	WEAPON_MELEE_WINDUP, //10
	WEAPON_MELEE_RELAX, //11
	WEAPON_UNKNOWN //12
} weaponstates;

typedef enum {
	WEAP_IDLE, //0
	WEAP_UNK, //1
	WEAP_ATTACK, //2
	WEAP_ATTACK_LASTSHOT, //3
	WEAP_RECHAMBER, //4
	WEAP_ADS_ATTACK, //5
	WEAP_ADS_ATTACK_LASTSHOT, //6
	WEAP_ADS_RECHAMBER, //7
	WEAP_MELEE_ATTACK, //8
	WEAP_DROP, //9
	WEAP_RAISE, //10
	WEAP_RELOAD, //11
	WEAP_RELOAD_EMPTY, //12
	WEAP_RELOAD_START, //13
	WEAP_RELOAD_END, //14
	WEAP_ALTSWITCHFROM, //15
	WEAP_ALTSWITCHTO, //16
	WEAP_UNKNOWN //17
} weaponanimations;

#define MAX_ENTITIES 1024
#define MAX_ENTITY_SIZE 1024
#define PLAYERSTATE_SIZE 0x22cc
#if CODPATCH == 1
#define GENTITY_SIZE 788
#else
#define GENTITY_SIZE 0x31c
#endif

typedef enum {
	SS_PLAYING,
	SS_DEAD,
	SS_SPECTATOR,
	SS_INTERMISSION
} sessionstate_types;

#if CODPATCH == 1
typedef enum {
	EOFF_S_SVFLAGS = 244,
	EOFF_S_GROUNDENTITYNUM = 124,
	
	EOFF_ETYPE = 4,
	EOFF_PHYSICSOBJECT = 353,
    EOFF_PLAYERSTATE = 344,
    EOFF_CONTENTS = 280,
	EOFF_TAKEDAMAGE = 369,
    EOFF_NEXTTHINK = 508,
	EOFF_FLAGS = 380,
    EOFF_THINK = 512,
    EOFF_USE = 528,
    EOFF_PAIN = 532,
    EOFF_DIE = 536,
    EOFF_HEALTH = 560,
    EOFF_CLASSNAME = 374, //it's a string index of scr_
    EOFF_ORIGIN = 308,
    EOFF_ANGLES = 320,
	EOFF_CONTROLLER = 544
} ENTITY_OFFSET;

#else

typedef enum {
	EOFF_S_ETYPE = 4,
	EOFF_EFLAGS = 8,
	EOFF_PLAYERSTATE = 348,
	EOFF_TAKEDAMAGE = 373,
	EOFF_NEXTTHINK = 516,
	EOFF_THINK = 520,
	EOFF_USE = 536,
	EOFF_PAIN = 540,
	EOFF_DIE = 544,
	EOFF_HEALTH = 568,
	EOFF_FLAGS = 388,
	EOFF_R_CONTENTS = 284,
	EOFF_R_SVFLAGS = 244,
	EOFF_TEAMMASTER = 620,
	EOFF_TEAMCHAIN = 616,
	EOFF_TEAM = 480,
	EOFF_INUSE = 356,
	EOFF_CLASSNAME = 380, //it's a string index of scr_
	EOFF_R_OWNERNUM = 336,
	EOFF_EVENTTIME = 392,
	EOFF_FREEAFTEREVENT = 396,
	EOFF_WAIT = 624,
	EOFF_RANDOM = 628,
	EOFF_CLIENTNUM = 144,
	EOFF_ORIGIN = 312,
	EOFF_ANGLES = 324,
	EOFF_PHYSICSOBJECT = 357,
	EOFF_UNLINKAFTEREVENT = 400,
	EOFF_GROUNDENTITYNUM = 124,
	EOFF_LOOPSOUND = 132,
	EOFF_SOUND_OPENING = 359,
	EOFF_SOUND_CLOSING = 360,
	EOFF_SOUND_OPEN_END = 361,
	EOFF_SOUND_OPEN_LOOP = 363,
	EOFF_SOUND_CLOSE_LOOP = 364,
	EOFF_SOUND_LOCKED = 365,
	EOFF_SOUND_OPENING_QUIET = 366,
	EOFF_SOUND_OPEN_QUIET_END = 367,
	EOFF_SOUND_CLOSING_QUIET = 368,
	EOFF_SOUND_CLOSE_QUIET_END = 369,
	EOFF_MOVERSTATE = 376,
	EOFF_SPAWNFLAGS = 384,
	EOFF_DAMAGE = 576,
	EOFF_SPEED = 488,
	EOFF_SPLASHDAMAGE = 580,
	EOFF_R_CURRENTORIGIN = 312,
	EOFF_PARENT = 416,
	EOFF_SPLASHRADIUS = 584,
	EOFF_SPLASHMETHODOFDEATH = 588,
	EOFF_R_EVENTTIME = 340
} ENTITY_OFFSET;

#endif

typedef enum {
	POFF_CLIENTNUM = 172,
	POFF_EFLAGS = 128,
	POFF_PM_TYPE = 4,
    POFF_VELOCITY = 0x20,
    POFF_ANGLES = 0xC0,
	POFF_SESSIONSTATE = 8400
} PLAYER_OFFSET;

#pragma pack(1)

typedef struct {
	char data[64]; //holds some values like origin of player before on turret, is being used flag, degrees of freedom (arcs)
} turret_entity_info; //size 0x40

typedef struct gentity_s gentity_t;
typedef struct gclient_s gclient_t;

typedef struct entityState_s {
	int number;
	entityType_t eType; //4
	int eFlags; //8
	trajectory_t pos; //12
	trajectory_t apos; //48
	int unk; //84 //time??
	int unk2; //88 //time2??
	vec3_t origin2; //92
	vec3_t angles2; //104 (guessed name)
	int otherEntityNum; //116
	int otherEntityNum2; //120
	int groundEntityNum; //124
	int constantLight; //128
	int loopSound; //132
	int surfaceFlags; //136
	int modelindex; //140
	int clientNum; //144
	char ___cba[0x34];
	/*
	gentity_t *teammaster; //152
	int eventParm; //160
	int eventSequence; //164
	int events[4]; //168
	int eventParms[4]; //184
	*/
	
	int weapon; //200
	int legsAnim; //204
	int torsoAnim; //208
	float leanf; //212
	int loopfxid; //216
	int hintstring; //220
	int animMovetype; //224
} entityState_t;

typedef struct playerState_s {
	int commandTime;            // cmd->serverTime of last executed command
	int pm_type;
	int bobCycle;               // for view bobbing and footstep generation
	int pm_flags;               // ducked, jump_held, etc
	int pm_time;
} playerState_t;

struct gclient_s {
	playerState_t ps;
	//other stuff
};

typedef enum {
	PERK_QUICK_RELOAD
} perk_names;

#define MAX_PERKS 16

typedef struct {
	
} more_ent;

struct gentity_s {
	entityState_t s;
	float PM_GetViewHeightLerpTime_unknown; //228
	float some_view_angle_when_prone; //232
	float some_view_angle_when_prone2; //236
	qboolean linked; //240
	int svFlags; //244
	int some_idk_num; //248
	int unk2; //252
	vec3_t mins, maxs; //256
	int contents; //280
	vec3_t absmin, absmax; //284
	vec3_t currentOrigin; //308
	vec3_t currentAngles; //320
	int ownerNum; //332
	int r_eventTime; //336
	int unk3; //340
	struct gclient_s *client; //344
	turret_entity_info *turret_info; //348
	byte inuse; //352
	byte physicsObject; //353
	byte _sounds[13]; //354
	byte idk; //367
	byte idk2; //368
	byte takedamage; //369
	byte active; //370
	byte idk3; //371
	byte moverState; //372
	unsigned char modelindex2; //373
	short classname; //374
	int spawnflags; //376
	int flags; //380
	int eventTime; //384
	int freeAfterEvent; //388
	int unlinkAfterEvent; //392
	float physicsBounce; //396
	int clipmask; //400
	int framenum; //404 (not sure)
	gentity_t *parent; //408
	gentity_t *nextTrain; //412
	
	unsigned char __i_dont_really_care_for_now[GENTITY_SIZE - 0x1A0 - sizeof(more_ent)];
};
#pragma pack(push, 1)

extern gentity_t *g_entities;
/*
#define ENT_SET(e, off, src, size) do { \
memcpy((void*)((int)e + off), (void*)src, size); \
} while(0)
#define ENT_GET(e, off, dest, size) do { \
memcpy((void*)dest, (void*)((int)e + off), size); \
} while(0)
*/

static inline void ENT_SET(gentity_t *e, int off, void *src, size_t size) {
	//printf("ENT_SET(%x, %d, %x, %d) ent num = %d\n", e, off, src, size, e->s.number);
	memcpy((void*)(((int)e) + off), src, size);
}
static inline void ENT_GET(gentity_t *e, int off, void *dest, size_t size) {
	//printf("ENT_GET(%x, %d, %x, %d) ent num = %d\n", e, off, dest, size, e->s.number);
	memcpy(dest, (void*)(((int)e) + off), size);
}

typedef struct {
	bool sprinting;
} xentity_t;

extern xentity_t xentities[1024];

extern char* modNames[];

typedef struct gitem_s {
	char        *classname;
	//rest idc
} gitem_t;

